000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. COMOVAI.
000003 AUTHOR. Fabricio Ferreira.
000004
000005 ENVIRONMENT DIVISION.
000006
000007 DATA DIVISION.
000008 WORkING-STORAGE SECTION.
000009 
000010 01 NOME    PIC A(020).
000011 
000012 01 DATA-ATUAL.
000013    05 ANO-ATUAL PIC 9(004).
000014    05 MES-ATUAL PIC 9(002).
000015    05 DIA-ATUAL PIC 9(002).
000016 
000017 PROCEDURE DIVISION.
000018
000019 PRINCIPAL.
000020     DISPLAY "Entre com seu Nome: ".
000021     ACCEPT NOME.
000022     ACCEPT DATA-ATUAL FROM DATE YYYYMMDD.
000023     DISPLAY "Bem vindo  "  NOME.
000024     DISPLAY "Sabia que hoje É "  DIA-ATUAL "/" MES-ATUAL "/"
            ANO-ATUAL.
000025            
000026 STOP RUN.
000027 END PROGRAM COMOVAI.
000028
