       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD.

       PROCEDURE DIVISION.
           DISPLAY "OLA FABRICIO! COBOL ESTA FUNCIONANDO!".
           STOP RUN.